#+TITLE: Dagger caches by operation graph, not content
#+LANGUAGE: en
#+PROPERTY: header-args:bash :tangle no :results verbatim :cache yes

Dagger's directory layer is content-addressed: two directories built
via completely different operation chains produce the same =digest()=
if their files are byte-for-byte identical.  However, exec caching
is graph-based: when the directory is mounted into a container, the
=withExec= cache key includes the full operation lineage — not the
content.  Two content-identical directories reached via different
graph paths produce different container IDs, and every =withExec=
downstream is a cache miss.

This study builds a minimal reproducer, proves the behavior, and
links to the upstream fix.

* Proving the directories are identical but containers are not

  =prove_identical= computes the content digest of both directories
  and the container ID after mounting each one.  It also tests three
  attempts to "flatten" the graph:

  - =sync()= — resolve the directory eagerly
  - copy through =with_directory(".", ...)= — rewrap in a fresh directory
  - round-trip through a container — mount, then extract with =.directory()=

  #+NAME: prove-identical
  #+begin_src python
  @function
  async def prove_identical(self) -> str:
      """Show that dir_a and dir_b have the same content digest but different container IDs."""
      dir_a = _dir_a()
      dir_b = _dir_b()

      digest_a = await dir_a.digest()
      digest_b = await dir_b.digest()

      ctr = dag.container().from_("alpine:latest")

      ctr_a = ctr.with_directory("/work", dir_a)
      ctr_b = ctr.with_directory("/work", dir_b)
      ctr_c = ctr.with_directory("/work", dir_a)

      # Attempt to flatten the graph
      dir_b_synced = await dir_b.sync()
      ctr_b_synced = ctr.with_directory("/work", dir_b_synced)

      dir_b_copied = dag.directory().with_directory(".", dir_b)
      ctr_b_copied = ctr.with_directory("/work", dir_b_copied)

      dir_b_roundtrip = (
          dag.container()
          .from_("alpine:latest")
          .with_directory("/work", dir_b)
          .directory("/work")
      )
      ctr_b_roundtrip = ctr.with_directory("/work", dir_b_roundtrip)

      id_a = await ctr_a.id()
      id_b = await ctr_b.id()
      id_c = await ctr_c.id()
      id_b_synced = await ctr_b_synced.id()
      id_b_copied = await ctr_b_copied.id()
      id_b_roundtrip = await ctr_b_roundtrip.id()

      return (
          f"dir digests identical: {digest_a == digest_b}\n"
          f"\n"
          f"a vs b (different graph, same content): {id_a == id_b}\n"
          f"a vs c (same graph):                    {id_a == id_c}\n"
          f"\n"
          f"flattening attempts (all should be True to fix caching):\n"
          f"  sync():                {id_a == id_b_synced}\n"
          f"  copy via with_directory: {id_a == id_b_copied}\n"
          f"  roundtrip via container: {id_a == id_b_roundtrip}"
      )
  #+end_src

  #+NAME: run_prove_identical
  #+begin_src bash
  dagger call prove-identical
  #+end_src

  #+RESULTS[b2f46ea30aff0bee9df33e2a67aaaf8dd626cb75]: run_prove_identical
  : dir digests identical: True
  : 
  : a vs b (different graph, same content): False
  : a vs c (same graph):                    True
  : 
  : flattening attempts (all should be True to fix caching):
  :   sync():                False
  :   copy via with_directory: False
  :   roundtrip via container: False

  The digests match but the container IDs do not.  No flattening
  technique produces a matching container ID.

* Observing the exec cache bust

  =cached= and =busted= mount =dir_a= and =dir_b= respectively into
  an alpine container and run the same slow command.

  Each takes a ~run~ argument so that re-calling with a different
  value forces the function to re-execute; that lets us observe the
  underlying =withExec= cache, not just the module-level result
  cache.

  #+NAME: cached
  #+begin_src python
  @function
  async def cached(self, run: int = 0) -> str:
      """Mount dir_a and run a slow command. Returns withExec elapsed seconds."""
      start = time.monotonic()
      await (
          dag.container()
          .from_("alpine:latest")
          .with_directory("/work", _dir_a())
          .with_exec(["sh", "-c", "sleep 3 && echo done"])
          .stdout()
      )
      return f"{time.monotonic() - start:.2f}s"
  #+end_src

  #+NAME: busted
  #+begin_src python
  @function
  async def busted(self, run: int = 0) -> str:
      """Mount dir_b (same content, different operation graph). Returns withExec elapsed seconds."""
      start = time.monotonic()
      await (
          dag.container()
          .from_("alpine:latest")
          .with_directory("/work", _dir_b())
          .with_exec(["sh", "-c", "sleep 3 && echo done"])
          .stdout()
      )
      return f"{time.monotonic() - start:.2f}s"
  #+end_src

  To observe the cache behavior, run the three calls below.  The
  three blocks share engine state within a single run.  Block 1
  prunes the engine's local cache first so the "populate" step is
  always a true populate.  Each call uses a different ~--run~ so
  that dagger's module-level result cache doesn't short-circuit and
  hide the =withExec= behavior we want to observe.

  Populate cache (~withExec~ runs, sleep 3 elapses)

  #+begin_src bash :results output :eval no-export
    dagger core engine local-cache prune > /dev/null 2>&1
    printf "withExec: "
    dagger call cached --run=1 2>/dev/null
  #+end_src

  #+RESULTS[546f65b2274f1b6d038b71f4e084a2afa240fe82]:
  : withExec: 5.03s

  Confirm cache hit — same graph, =withExec= served from LLB cache

  #+begin_src bash :results output :eval no-export
    printf "withExec: "
    dagger call cached --run=2 2>/dev/null
  #+end_src

  #+RESULTS[7c7cecfeb5243bea7913f72031055f26d7ecef4e]:
  : withExec: 0.17s

  Same content, different graph — =withExec= misses cache despite
  byte-identical mounted directory

  #+begin_src bash :results output :eval no-export
    printf "withExec: "
    dagger call busted --run=1 2>/dev/null
  #+end_src

  #+RESULTS[09ff4351527de91b0d89c08a2bc1c478f0907796]:
  : withExec: 3.31s

  Reading the three outputs:

  - Block 1: =withExec: ~3s= — sleep 3 actually ran.  This
    populates the =withExec= LLB cache for the =cached= graph.
  - Block 2: =withExec: <0.1s= — withExec was served from cache.
    The function re-executed (=--run=2= differs from =--run=1=), but
    the underlying =withExec= recognised the same container and
    command and served the stored output.
  - Block 3: =withExec: ~3s= — re-ran despite =_dir_b()= producing
    byte-identical content to =_dir_a()=.  Dagger's exec cache key
    depends on the full container LLB lineage, not the resulting
    directory digest, so the different graph path triggers a cache
    miss.

